summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxPsi5_regdef.h
/** \\brief  Receiver Control Register C */
typedef struct _Ifx_PSI5_CH_RCRC_Bits
{
    unsigned int BRS:1;                     /**< \brief [0:0] Baud Rate Select (rw) */
    unsigned int TSP:2;                     /**< \brief [2:1] Time Stamp Select for Pulses (rw) */
    unsigned int TSF:2;                     /**< \brief [4:3] Time Stamp Select for Start of Frame (SOF) (rw) */
    unsigned int TSR:1;                     /**< \brief [5:5] Time Stamp Select for Receive Data Registers (rw) */
    unsigned int reserved_6:26;             /**< \brief \internal Reserved */
} Ifx_PSI5_CH_RCRC_Bits;

/** \\brief  Receive Data Register High */
typedef struct _Ifx_PSI5_CH_RDRH_Bits
{
    unsigned int TS:24;                     /**< \brief [23:0] Time Stamp (rh) */
    unsigned int SC:3;                      /**< \brief [26:24] Slot Counter (rh) */
    unsigned int TEI:1;                     /**< \brief [27:27] Time Slot Error Flag (rh) */
    unsigned int NBI:1;                     /**< \brief [28:28] Number of bits Error Flag (rh) */
    unsigned int MEI:1;                     /**< \brief [29:29] Error in Message Bits Flag (rh) */
    unsigned int NFI:1;                     /**< \brief [30:30] No Frame Received Flag (rh) */
    unsigned int RBI:1;                     /**< \brief [31:31] Receive Buffer Overflow Flag (rh) */
} Ifx_PSI5_CH_RDRH_Bits;

/** \\brief  Receive Data Register Low */
typedef struct _Ifx_PSI5_CH_RDRL_Bits
{
    unsigned int CRCI:1;                    /**< \brief [0:0] CRC Error Flag (rh) */
    unsigned int CRC:3;                     /**< \brief [3:1] CRC (rh) */
    unsigned int RD:28;                     /**< \brief [31:4] RD (rh) */
} Ifx_PSI5_CH_RDRL_Bits;

/** \\brief  Receive Status Register */
typedef struct _Ifx_PSI5_CH_RSR_Bits
{
    unsigned int CRC:3;                     /**< \brief [2:0] CRC (r) */
    unsigned int reserved_3:5;              /**< \brief \internal Reserved */
    unsigned int MSG:2;                     /**< \brief [9:8] Messaging Bits (r) */
    unsigned int reserved_10:22;            /**< \brief \internal Reserved */
} Ifx_PSI5_CH_RSR_Bits;

/** \\brief  Send Control Register */
typedef struct _Ifx_PSI5_CH_SCR_Bits
{
    unsigned int PLL:6;                     /**< \brief [5:0] Pay Load Length of Registers SDRL/H (rw) */
    unsigned int EPS:1;                     /**< \brief [6:6] Enhanced Protocol Selection (rw) */
    unsigned int BSC:1;                     /**< \brief [7:7] Bit Stuffing Control (rw) */
    unsigned int SSL:6;                     /**< \brief [13:8] Pay Load Length of Registers SSRL/H (rw) */
    unsigned int FLUS:1;                    /**< \brief [14:14] Flush SSRH/Lx (w) */
    unsigned int FLUO:1;                    /**< \brief [15:15] Flush SORH/Lx (w) */
    unsigned int SOL:6;                     /**< \brief [21:16] Pay Load Length of Registers SORL/H (rw) */
    unsigned int CRC:1;                     /**< \brief [22:22] CRC Generation Control (rw) */
    unsigned int STA:1;                     /**< \brief [23:23] Start Sequence Generation Control (rw) */
    unsigned int INH:1;                     /**< \brief [24:24] Inhibit Transfer (rw) */
    unsigned int GO:1;                      /**< \brief [25:25] Release prepared Send data (w) */
    unsigned int TPF:1;                     /**< \brief [26:26] Transmit Preparation Flag (r) */
    unsigned int TSF:1;                     /**< \brief [27:27] Transmit Shift Flag (r) */
    unsigned int TOF:1;                     /**< \brief [28:28] Transmit Output Flag (r) */
    unsigned int reserved_29:2;             /**< \brief \internal Reserved */
    unsigned int TRQ:1;                     /**< \brief [31:31] Transfer Request in Progress (r) */
} Ifx_PSI5_CH_SCR_Bits;

/** \\brief  Send Data Register High */
typedef struct _Ifx_PSI5_CH_SDRH_Bits
{
    unsigned int SD32:1;                    /**< \brief [0:0] SDy (rw) */
    unsigned int SD33:1;                    /**< \brief [1:1] SDy (rw) */
    unsigned int SD34:1;                    /**< \brief [2:2] SDy (rw) */
    unsigned int SD35:1;                    /**< \brief [3:3] SDy (rw) */
    unsigned int SD36:1;                    /**< \brief [4:4] SDy (rw) */
    unsigned int SD37:1;                    /**< \brief [5:5] SDy (rw) */
    unsigned int SD38:1;                    /**< \brief [6:6] SDy (rw) */
    unsigned int SD39:1;                    /**< \brief [7:7] SDy (rw) */
    unsigned int SD40:1;                    /**< \brief [8:8] SDy (rw) */
    unsigned int SD41:1;                    /**< \brief [9:9] SDy (rw) */
    unsigned int SD42:1;                    /**< \brief [10:10] SDy (rw) */
    unsigned int SD43:1;                    /**< \brief [11:11] SDy (rw) */
    unsigned int SD44:1;                    /**< \brief [12:12] SDy (rw) */
    unsigned int SD45:1;                    /**< \brief [13:13] SDy (rw) */
    unsigned int SD46:1;                    /**< \brief [14:14] SDy (rw) */
    unsigned int SD47:1;                    /**< \brief [15:15] SDy (rw) */
    unsigned int SD48:1;                    /**< \brief [16:16] SDy (rw) */
    unsigned int SD49:1;                    /**< \brief [17:17] SDy (rw) */
    unsigned int SD50:1;                    /**< \brief [18:18] SDy (rw) */
    unsigned int SD51:1;                    /**< \brief [19:19] SDy (rw) */
    unsigned int SD52:1;                    /**< \brief [20:20] SDy (rw) */
    unsigned int SD53:1;                    /**< \brief [21:21] SDy (rw) */
    unsigned int SD54:1;                    /**< \brief [22:22] SDy (rw) */
    unsigned int SD55:1;                    /**< \brief [23:23] SDy (rw) */
    unsigned int SD56:1;                    /**< \brief [24:24] SDy (rw) */
    unsigned int SD57:1;                    /**< \brief [25:25] SDy (rw) */
    unsigned int SD58:1;                    /**< \brief [26:26] SDy (rw) */
    unsigned int SD59:1;                    /**< \brief [27:27] SDy (rw) */
    unsigned int SD60:1;                    /**< \brief [28:28] SDy (rw) */
    unsigned int SD61:1;                    /**< \brief [29:29] SDy (rw) */
    unsigned int SD62:1;                    /**< \brief [30:30] SDy (rw) */
    unsigned int SD63:1;                    /**< \brief [31:31] SDy (rw) */
} Ifx_PSI5_CH_SDRH_Bits;

/** \\brief  Send Data Register Low */
typedef struct _Ifx_PSI5_CH_SDRL_Bits
{
    unsigned int SD0:1;                     /**< \brief [0:0] SDy (rw) */
    unsigned int SD1:1;                     /**< \brief [1:1] SDy (rw) */
    unsigned int SD2:1;                     /**< \brief [2:2] SDy (rw) */
    unsigned int SD3:1;                     /**< \brief [3:3] SDy (rw) */
    unsigned int SD4:1;                     /**< \brief [4:4] SDy (rw) */
    unsigned int SD5:1;                     /**< \brief [5:5] SDy (rw) */
    unsigned int SD6:1;                     /**< \brief [6:6] SDy (rw) */
    unsigned int SD7:1;                     /**< \brief [7:7] SDy (rw) */
    unsigned int SD8:1;                     /**< \brief [8:8] SDy (rw) */
    unsigned int SD9:1;                     /**< \brief [9:9] SDy (rw) */
    unsigned int SD10:1;                    /**< \brief [10:10] SDy (rw) */
    unsigned int SD11:1;                    /**< \brief [11:11] SDy (rw) */
    unsigned int SD12:1;                    /**< \brief [12:12] SDy (rw) */
    unsigned int SD13:1;                    /**< \brief [13:13] SDy (rw) */
    unsigned int SD14:1;                    /**< \brief [14:14] SDy (rw) */
    unsigned int SD15:1;                    /**< \brief [15:15] SDy (rw) */
    unsigned int SD16:1;                    /**< \brief [16:16] SDy (rw) */
    unsigned int SD17:1;                    /**< \brief [17:17] SDy (rw) */
    unsigned int SD18:1;                    /**< \brief [18:18] SDy (rw) */
    unsigned int SD19:1;                    /**< \brief [19:19] SDy (rw) */
    unsigned int SD20:1;                    /**< \brief [20:20] SDy (rw) */
    unsigned int SD21:1;                    /**< \brief [21:21] SDy (rw) */
    unsigned int SD22:1;                    /**< \brief [22:22] SDy (rw) */
    unsigned int SD23:1;                    /**< \brief [23:23] SDy (rw) */
    unsigned int SD24:1;                    /**< \brief [24:24] SDy (rw) */
    unsigned int SD25:1;                    /**< \brief [25:25] SDy (rw) */
    unsigned int SD26:1;                    /**< \brief [26:26] SDy (rw) */
    unsigned int SD27:1;                    /**< \brief [27:27] SDy (rw) */
    unsigned int SD28:1;                    /**< \brief [28:28] SDy (rw) */
    unsigned int SD29:1;                    /**< \brief [29:29] SDy (rw) */
    unsigned int SD30:1;                    /**< \brief [30:30] SDy (rw) */
    unsigned int SD31:1;                    /**< \brief [31:31] SDy (rw) */
} Ifx_PSI5_CH_SDRL_Bits;

/** \\brief  Serial Data and Status Register */
typedef struct _Ifx_PSI5_CH_SDS_Bits
{
    unsigned int SD:16;                     /**< \brief [15:0] Serial Data (r) */
    unsigned int MID:8;                     /**< \brief [23:16] Message ID (r) */
    unsigned int SCRC:6;                    /**< \brief [29:24] SCRC (r) */
    unsigned int SCRI:1;                    /**< \brief [30:30] CRC of Serial Message failed Interrupt Flag. (r) */
    unsigned int CON:1;                     /**< \brief [31:31] Configuration bit (r) */
} Ifx_PSI5_CH_SDS_Bits;

