summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxPsi5_regdef.h
/** \\brief  SOF TS Capture Register SFTSC */
typedef struct _Ifx_PSI5_CH_SFTSC_Bits
{
    unsigned int TS:24;                     /**< \brief [23:0] Time Stamp (rh) */
    unsigned int reserved_24:8;             /**< \brief \internal Reserved */
} Ifx_PSI5_CH_SFTSC_Bits;

/** \\brief  Send Output Register High */
typedef struct _Ifx_PSI5_CH_SORH_Bits
{
    unsigned int SD32:1;                    /**< \brief [0:0] SDy (rw) */
    unsigned int SD33:1;                    /**< \brief [1:1] SDy (rw) */
    unsigned int SD34:1;                    /**< \brief [2:2] SDy (rw) */
    unsigned int SD35:1;                    /**< \brief [3:3] SDy (rw) */
    unsigned int SD36:1;                    /**< \brief [4:4] SDy (rw) */
    unsigned int SD37:1;                    /**< \brief [5:5] SDy (rw) */
    unsigned int SD38:1;                    /**< \brief [6:6] SDy (rw) */
    unsigned int SD39:1;                    /**< \brief [7:7] SDy (rw) */
    unsigned int SD40:1;                    /**< \brief [8:8] SDy (rw) */
    unsigned int SD41:1;                    /**< \brief [9:9] SDy (rw) */
    unsigned int SD42:1;                    /**< \brief [10:10] SDy (rw) */
    unsigned int SD43:1;                    /**< \brief [11:11] SDy (rw) */
    unsigned int SD44:1;                    /**< \brief [12:12] SDy (rw) */
    unsigned int SD45:1;                    /**< \brief [13:13] SDy (rw) */
    unsigned int SD46:1;                    /**< \brief [14:14] SDy (rw) */
    unsigned int SD47:1;                    /**< \brief [15:15] SDy (rw) */
    unsigned int SD48:1;                    /**< \brief [16:16] SDy (rw) */
    unsigned int SD49:1;                    /**< \brief [17:17] SDy (rw) */
    unsigned int SD50:1;                    /**< \brief [18:18] SDy (rw) */
    unsigned int SD51:1;                    /**< \brief [19:19] SDy (rw) */
    unsigned int SD52:1;                    /**< \brief [20:20] SDy (rw) */
    unsigned int SD53:1;                    /**< \brief [21:21] SDy (rw) */
    unsigned int SD54:1;                    /**< \brief [22:22] SDy (rw) */
    unsigned int SD55:1;                    /**< \brief [23:23] SDy (rw) */
    unsigned int SD56:1;                    /**< \brief [24:24] SDy (rw) */
    unsigned int SD57:1;                    /**< \brief [25:25] SDy (rw) */
    unsigned int SD58:1;                    /**< \brief [26:26] SDy (rw) */
    unsigned int SD59:1;                    /**< \brief [27:27] SDy (rw) */
    unsigned int SD60:1;                    /**< \brief [28:28] SDy (rw) */
    unsigned int SD61:1;                    /**< \brief [29:29] SDy (rw) */
    unsigned int SD62:1;                    /**< \brief [30:30] SDy (rw) */
    unsigned int SD63:1;                    /**< \brief [31:31] SDy (rw) */
} Ifx_PSI5_CH_SORH_Bits;

/** \\brief  Send Output Register Low */
typedef struct _Ifx_PSI5_CH_SORL_Bits
{
    unsigned int SD0:1;                     /**< \brief [0:0] SDy (rw) */
    unsigned int SD1:1;                     /**< \brief [1:1] SDy (rw) */
    unsigned int SD2:1;                     /**< \brief [2:2] SDy (rw) */
    unsigned int SD3:1;                     /**< \brief [3:3] SDy (rw) */
    unsigned int SD4:1;                     /**< \brief [4:4] SDy (rw) */
    unsigned int SD5:1;                     /**< \brief [5:5] SDy (rw) */
    unsigned int SD6:1;                     /**< \brief [6:6] SDy (rw) */
    unsigned int SD7:1;                     /**< \brief [7:7] SDy (rw) */
    unsigned int SD8:1;                     /**< \brief [8:8] SDy (rw) */
    unsigned int SD9:1;                     /**< \brief [9:9] SDy (rw) */
    unsigned int SD10:1;                    /**< \brief [10:10] SDy (rw) */
    unsigned int SD11:1;                    /**< \brief [11:11] SDy (rw) */
    unsigned int SD12:1;                    /**< \brief [12:12] SDy (rw) */
    unsigned int SD13:1;                    /**< \brief [13:13] SDy (rw) */
    unsigned int SD14:1;                    /**< \brief [14:14] SDy (rw) */
    unsigned int SD15:1;                    /**< \brief [15:15] SDy (rw) */
    unsigned int SD16:1;                    /**< \brief [16:16] SDy (rw) */
    unsigned int SD17:1;                    /**< \brief [17:17] SDy (rw) */
    unsigned int SD18:1;                    /**< \brief [18:18] SDy (rw) */
    unsigned int SD19:1;                    /**< \brief [19:19] SDy (rw) */
    unsigned int SD20:1;                    /**< \brief [20:20] SDy (rw) */
    unsigned int SD21:1;                    /**< \brief [21:21] SDy (rw) */
    unsigned int SD22:1;                    /**< \brief [22:22] SDy (rw) */
    unsigned int SD23:1;                    /**< \brief [23:23] SDy (rw) */
    unsigned int SD24:1;                    /**< \brief [24:24] SDy (rw) */
    unsigned int SD25:1;                    /**< \brief [25:25] SDy (rw) */
    unsigned int SD26:1;                    /**< \brief [26:26] SDy (rw) */
    unsigned int SD27:1;                    /**< \brief [27:27] SDy (rw) */
    unsigned int SD28:1;                    /**< \brief [28:28] SDy (rw) */
    unsigned int SD29:1;                    /**< \brief [29:29] SDy (rw) */
    unsigned int SD30:1;                    /**< \brief [30:30] SDy (rw) */
    unsigned int SD31:1;                    /**< \brief [31:31] SDy (rw) */
} Ifx_PSI5_CH_SORL_Bits;

/** \\brief  SOP TS Capture Register SPTSC */
typedef struct _Ifx_PSI5_CH_SPTSC_Bits
{
    unsigned int TS:24;                     /**< \brief [23:0] Time Stamp (rh) */
    unsigned int reserved_24:8;             /**< \brief \internal Reserved */
} Ifx_PSI5_CH_SPTSC_Bits;

/** \\brief  Send Shift Register High */
typedef struct _Ifx_PSI5_CH_SSRH_Bits
{
    unsigned int SD32:1;                    /**< \brief [0:0] SDy (rw) */
    unsigned int SD33:1;                    /**< \brief [1:1] SDy (rw) */
    unsigned int SD34:1;                    /**< \brief [2:2] SDy (rw) */
    unsigned int SD35:1;                    /**< \brief [3:3] SDy (rw) */
    unsigned int SD36:1;                    /**< \brief [4:4] SDy (rw) */
    unsigned int SD37:1;                    /**< \brief [5:5] SDy (rw) */
    unsigned int SD38:1;                    /**< \brief [6:6] SDy (rw) */
    unsigned int SD39:1;                    /**< \brief [7:7] SDy (rw) */
    unsigned int SD40:1;                    /**< \brief [8:8] SDy (rw) */
    unsigned int SD41:1;                    /**< \brief [9:9] SDy (rw) */
    unsigned int SD42:1;                    /**< \brief [10:10] SDy (rw) */
    unsigned int SD43:1;                    /**< \brief [11:11] SDy (rw) */
    unsigned int SD44:1;                    /**< \brief [12:12] SDy (rw) */
    unsigned int SD45:1;                    /**< \brief [13:13] SDy (rw) */
    unsigned int SD46:1;                    /**< \brief [14:14] SDy (rw) */
    unsigned int SD47:1;                    /**< \brief [15:15] SDy (rw) */
    unsigned int SD48:1;                    /**< \brief [16:16] SDy (rw) */
    unsigned int SD49:1;                    /**< \brief [17:17] SDy (rw) */
    unsigned int SD50:1;                    /**< \brief [18:18] SDy (rw) */
    unsigned int SD51:1;                    /**< \brief [19:19] SDy (rw) */
    unsigned int SD52:1;                    /**< \brief [20:20] SDy (rw) */
    unsigned int SD53:1;                    /**< \brief [21:21] SDy (rw) */
    unsigned int SD54:1;                    /**< \brief [22:22] SDy (rw) */
    unsigned int SD55:1;                    /**< \brief [23:23] SDy (rw) */
    unsigned int SD56:1;                    /**< \brief [24:24] SDy (rw) */
    unsigned int SD57:1;                    /**< \brief [25:25] SDy (rw) */
    unsigned int SD58:1;                    /**< \brief [26:26] SDy (rw) */
    unsigned int SD59:1;                    /**< \brief [27:27] SDy (rw) */
    unsigned int SD60:1;                    /**< \brief [28:28] SDy (rw) */
    unsigned int SD61:1;                    /**< \brief [29:29] SDy (rw) */
    unsigned int SD62:1;                    /**< \brief [30:30] SDy (rw) */
    unsigned int SD63:1;                    /**< \brief [31:31] SDy (rw) */
} Ifx_PSI5_CH_SSRH_Bits;

