summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxPsi5_regdef.h
/** \\brief  RSIOV Set Register */
typedef struct _Ifx_PSI5_RSISET_Bits
{
    unsigned int RSI0:1;                    /**< \brief [0:0] Set RSI Flag of Buffer y (w) */
    unsigned int RSI1:1;                    /**< \brief [1:1] Set RSI Flag of Buffer y (w) */
    unsigned int RSI2:1;                    /**< \brief [2:2] Set RSI Flag of Buffer y (w) */
    unsigned int RSI3:1;                    /**< \brief [3:3] Set RSI Flag of Buffer y (w) */
    unsigned int RSI4:1;                    /**< \brief [4:4] Set RSI Flag of Buffer y (w) */
    unsigned int RSI5:1;                    /**< \brief [5:5] Set RSI Flag of Buffer y (w) */
    unsigned int RSI6:1;                    /**< \brief [6:6] Set RSI Flag of Buffer y (w) */
    unsigned int RSI7:1;                    /**< \brief [7:7] Set RSI Flag of Buffer y (w) */
    unsigned int RSI8:1;                    /**< \brief [8:8] Set RSI Flag of Buffer y (w) */
    unsigned int RSI9:1;                    /**< \brief [9:9] Set RSI Flag of Buffer y (w) */
    unsigned int RSI10:1;                   /**< \brief [10:10] Set RSI Flag of Buffer y (w) */
    unsigned int RSI11:1;                   /**< \brief [11:11] Set RSI Flag of Buffer y (w) */
    unsigned int RSI12:1;                   /**< \brief [12:12] Set RSI Flag of Buffer y (w) */
    unsigned int RSI13:1;                   /**< \brief [13:13] Set RSI Flag of Buffer y (w) */
    unsigned int RSI14:1;                   /**< \brief [14:14] Set RSI Flag of Buffer y (w) */
    unsigned int RSI15:1;                   /**< \brief [15:15] Set RSI Flag of Buffer y (w) */
    unsigned int RSI16:1;                   /**< \brief [16:16] Set RSI Flag of Buffer y (w) */
    unsigned int RSI17:1;                   /**< \brief [17:17] Set RSI Flag of Buffer y (w) */
    unsigned int RSI18:1;                   /**< \brief [18:18] Set RSI Flag of Buffer y (w) */
    unsigned int RSI19:1;                   /**< \brief [19:19] Set RSI Flag of Buffer y (w) */
    unsigned int RSI20:1;                   /**< \brief [20:20] Set RSI Flag of Buffer y (w) */
    unsigned int RSI21:1;                   /**< \brief [21:21] Set RSI Flag of Buffer y (w) */
    unsigned int RSI22:1;                   /**< \brief [22:22] Set RSI Flag of Buffer y (w) */
    unsigned int RSI23:1;                   /**< \brief [23:23] Set RSI Flag of Buffer y (w) */
    unsigned int RSI24:1;                   /**< \brief [24:24] Set RSI Flag of Buffer y (w) */
    unsigned int RSI25:1;                   /**< \brief [25:25] Set RSI Flag of Buffer y (w) */
    unsigned int RSI26:1;                   /**< \brief [26:26] Set RSI Flag of Buffer y (w) */
    unsigned int RSI27:1;                   /**< \brief [27:27] Set RSI Flag of Buffer y (w) */
    unsigned int RSI28:1;                   /**< \brief [28:28] Set RSI Flag of Buffer y (w) */
    unsigned int RSI29:1;                   /**< \brief [29:29] Set RSI Flag of Buffer y (w) */
    unsigned int RSI30:1;                   /**< \brief [30:30] Set RSI Flag of Buffer y (w) */
    unsigned int RSI31:1;                   /**< \brief [31:31] Set RSI Flag of Buffer y (w) */
} Ifx_PSI5_RSISET_Bits;

/** \\brief  TEIOV Clear Register */
typedef struct _Ifx_PSI5_TEICLR_Bits
{
    unsigned int TEI0:1;                    /**< \brief [0:0] Clear TEI Flag of Buffer y (w) */
    unsigned int TEI1:1;                    /**< \brief [1:1] Clear TEI Flag of Buffer y (w) */
    unsigned int TEI2:1;                    /**< \brief [2:2] Clear TEI Flag of Buffer y (w) */
    unsigned int TEI3:1;                    /**< \brief [3:3] Clear TEI Flag of Buffer y (w) */
    unsigned int TEI4:1;                    /**< \brief [4:4] Clear TEI Flag of Buffer y (w) */
    unsigned int TEI5:1;                    /**< \brief [5:5] Clear TEI Flag of Buffer y (w) */
    unsigned int TEI6:1;                    /**< \brief [6:6] Clear TEI Flag of Buffer y (w) */
    unsigned int TEI7:1;                    /**< \brief [7:7] Clear TEI Flag of Buffer y (w) */
    unsigned int TEI8:1;                    /**< \brief [8:8] Clear TEI Flag of Buffer y (w) */
    unsigned int TEI9:1;                    /**< \brief [9:9] Clear TEI Flag of Buffer y (w) */
    unsigned int TEI10:1;                   /**< \brief [10:10] Clear TEI Flag of Buffer y (w) */
    unsigned int TEI11:1;                   /**< \brief [11:11] Clear TEI Flag of Buffer y (w) */
    unsigned int TEI12:1;                   /**< \brief [12:12] Clear TEI Flag of Buffer y (w) */
    unsigned int TEI13:1;                   /**< \brief [13:13] Clear TEI Flag of Buffer y (w) */
    unsigned int TEI14:1;                   /**< \brief [14:14] Clear TEI Flag of Buffer y (w) */
    unsigned int TEI15:1;                   /**< \brief [15:15] Clear TEI Flag of Buffer y (w) */
    unsigned int TEI16:1;                   /**< \brief [16:16] Clear TEI Flag of Buffer y (w) */
    unsigned int TEI17:1;                   /**< \brief [17:17] Clear TEI Flag of Buffer y (w) */
    unsigned int TEI18:1;                   /**< \brief [18:18] Clear TEI Flag of Buffer y (w) */
    unsigned int TEI19:1;                   /**< \brief [19:19] Clear TEI Flag of Buffer y (w) */
    unsigned int TEI20:1;                   /**< \brief [20:20] Clear TEI Flag of Buffer y (w) */
    unsigned int TEI21:1;                   /**< \brief [21:21] Clear TEI Flag of Buffer y (w) */
    unsigned int TEI22:1;                   /**< \brief [22:22] Clear TEI Flag of Buffer y (w) */
    unsigned int TEI23:1;                   /**< \brief [23:23] Clear TEI Flag of Buffer y (w) */
    unsigned int TEI24:1;                   /**< \brief [24:24] Clear TEI Flag of Buffer y (w) */
    unsigned int TEI25:1;                   /**< \brief [25:25] Clear TEI Flag of Buffer y (w) */
    unsigned int TEI26:1;                   /**< \brief [26:26] Clear TEI Flag of Buffer y (w) */
    unsigned int TEI27:1;                   /**< \brief [27:27] Clear TEI Flag of Buffer y (w) */
    unsigned int TEI28:1;                   /**< \brief [28:28] Clear TEI Flag of Buffer y (w) */
    unsigned int TEI29:1;                   /**< \brief [29:29] Clear TEI Flag of Buffer y (w) */
    unsigned int TEI30:1;                   /**< \brief [30:30] Clear TEI Flag of Buffer y (w) */
    unsigned int TEI31:1;                   /**< \brief [31:31] Clear TEI Flag of Buffer y (w) */
} Ifx_PSI5_TEICLR_Bits;

